lvx/base/Catalogs/бит_ДиапазонКатегорийЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ДиапазонКатегорийЦен</Name>
			<Comment>ЛТ2.2</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенаОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяЦенаКатегории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_ДиапазонКатегорийЦен/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ЦенаОт) Тогда
		ЦенаОт = ПолучитьСледующуюЦенуОт();
	КонецЕсли;

КонецПроцедуры 

Функция ПолучитьСледующуюЦенуОт()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Спр.ЦенаДо) КАК МаксЦенаДо
	|ИЗ
	|	Справочник.бит_ДиапазонКатегорийЦен КАК Спр
	|ГДЕ
	|	НЕ Спр.ПометкаУдаления";

	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() И ЗначениеЗаполнено(Результат.МаксЦенаДо) Тогда
		Возврат Результат.МаксЦенаДо;
	КонецЕсли;

	Возврат 0;

КонецФункции

Процедура ПередЗаписью(Отказ)

	Если ЦенаДо < ЦенаОт Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ЦенаДо не может быть меньше ЦенаОт", , , , Отказ);
	ИначеЕсли (ЦенаДо - ЦенаОт) < 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Минимальная разница между порогами значений 1 рубль", , , , Отказ);
	ИначеЕсли ЕстьПересечениеДиапазонов() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Диапазон цен пересекается с уже существующим диапазоном", , , , Отказ);
	КонецЕсли;

КонецПроцедуры

Функция ЕстьПересечениеДиапазонов()

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						|	Спр.Ссылка
						|ИЗ
						|	Справочник.бит_ДиапазонКатегорийЦен КАК Спр
						|ГДЕ
						|	НЕ Спр.ПометкаУдаления
						|	И Спр.Ссылка <> &ТекущаяСсылка
						|	И Спр.ЦенаОт < &ЦенаДо
						|	И Спр.ЦенаДо > &ЦенаОт");

	Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
	Запрос.УстановитьПараметр("ЦенаОт", ЦенаОт);
	Запрос.УстановитьПараметр("ЦенаДо", ЦенаДо);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	//ЦенаОт = ПолучитьСледующуюЦенуОт();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(СегментНоменклатуры) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	НоменклатураСегмента.Номенклатура КАК Номенклатура
		                      |ИЗ
		                      |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		                      |ГДЕ
		                      |	НоменклатураСегмента.Сегмент = &Сегмент");	
		Запрос.УстановитьПараметр("Сегмент", СегментНоменклатуры);
		Если Не Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Диапазон привязан к сегменту в котором уже есть номенклатура. Удаление запрещено", , , , Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
